In [1]:
import pandas as pd
import numpy as np

# a. Print the first five rows of the DataFrame.  
# b. Get the summary statistics of the 'Age' and 'Salary' columns.  
# c. Calculate the average salary of employees in the 'HR' department.  

data = {
      'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
      'Age': [24, 27, 22, 32, 29],
      'Department': ['HR', 'Finance', 'IT', 'Marketing', 'HR'],
      'Salary': [45000, 54000, 50000, 62000, 47000]
  }

data_pd = pd.DataFrame(data)
print(data_pd)

print("-------------------------------")

print("First five rows:")
print(data_pd.head())

print("summary: ")
print(data_pd[['Age','Salary']].describe().round(3))

a = data_pd[data_pd['Department']=='HR']['Salary'].mean() # this mean() method will calculate the average 

print("avg salary of hr department employees:", a)

      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000
-------------------------------
First five rows:
      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000
summary:
          Age     Salary
count   5.000      5.000
mean   26.800  51600.000
std     3.962   6730.527
min    22.000  45000.000
25%    24.000  47000.000
50%    27.000  50000.000
75%    29.000  54000.000
max    32.000  62000.000
avg salary of hr department employees: 46000.0

In [5]:
# Add a new column, 'Bonus', which is 10% of the salary. 

data_pd['Bonus'] = (data_pd['Salary'] * 0.10).astype(int)
print(data_pd)

      Name  Age Department  Salary  Bonus
0    Alice   24         HR   45000   4500
1      Bob   27    Finance   54000   5400
2  Charlie   22         IT   50000   5000
3    Diana   32  Marketing   62000   6200
4      Eve   29         HR   47000   4700

In [7]:
#  Filter the DataFrame to show employees aged between 25 and 30.

data_pd[data_pd['Age'].between(25,30)]

  Name  Age Department  Salary  Bonus
1  Bob   27    Finance   54000   5400
4  Eve   29         HR   47000   4700

In [12]:
# 4. Group the data by 'Department' and calculate the average salary for each department. 
avg = data_pd.groupby('Department')['Salary'].mean().astype(int)
avg

Department
Finance      54000
HR           46000
IT           50000
Marketing    62000
Name: Salary, dtype: int64

In [16]:
# 5. Sort the DataFrame by 'Salary' in ascending order and save the result to a new CSV file

sort = data_pd.sort_values('Salary', ascending=True)
sort.to_csv('sorted_data_pd.csv')  # this will create a csv file and save it in save folder 
sort

      Name  Age Department  Salary  Bonus
0    Alice   24         HR   45000   4500
4      Eve   29         HR   47000   4700
2  Charlie   22         IT   50000   5000
1      Bob   27    Finance   54000   5400
3    Diana   32  Marketing   62000   6200